1<p style="text-align:center">
    <a href="https://skills.network/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo"  />
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction

Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones.

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage.

Therefore if we can determine if the first stage will land, we can determine the cost of a launch.

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

<a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01" target="_blank">Spacex DataSet</a>

### Store the dataset in database table

**it is highly recommended to manually load the table using the database console LOAD tool in DB2**.

<img src = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/images/spacexload.png">

Now open the Db2 console, open the LOAD tool, Select / Drag the .CSV file for the  dataset, Next create a New Table, and then follow the steps on-screen instructions to load the data. Name the new table as follows:

**SPACEXDATASET**

**Follow these steps while using old DB2 UI which is having Open Console Screen**

**Note:While loading Spacex dataset, ensure that detect datatypes is disabled. Later click on the pencil icon(edit option).**

1.  Change the Date Format by manually typing DD-MM-YYYY and timestamp format as DD-MM-YYYY HH\:MM:SS.

    Here you should place the cursor at Date field and manually type as DD-MM-YYYY.

2.  Change the PAYLOAD_MASS\_\_KG\_  datatype  to INTEGER.

<img src = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/images/spacexload2.png">

**Changes to be considered when having DB2 instance with the new UI having Go to UI screen**

*   Refer to this insruction in this <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sign%20up%20for%20IBM%20Cloud%20-%20Create%20Db2%20service%20instance%20-%20Get%20started%20with%20the%20Db2%20console/instructional-labs.md.html?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01">link</a> for viewing  the new  Go to UI screen.

*   Later click on **Data link(below SQL)**  in the Go to UI screen  and click on **Load Data** tab.

*   Later browse for the downloaded spacex file.

<img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/images/browsefile.png" width="800"/>

*   Once done select the schema andload the file.

 <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/images/spacexload3.png" width="800"/>

In [ ]:
!pip install sqlalchemy==1.3.9
!pip install ibm_db_sa
!pip install ipython-sql

In [1]:
import pandas as pd
import sqlalchemy
import pymysql
import mysql.connector

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [3]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql




**DB2 magic in case of old UI service credentials.**

In the next cell enter your db2 connection string. Recall you created Service Credentials for your Db2 instance before. From the **uri** field of your Db2 service credentials copy everything after db2:// (except the double quote at the end) and paste it in the cell below after ibm_db_sa://

<img src ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_edX/images/URI.jpg">

in the following format

**%sql ibm_db_sa://my-username:my-password\@my-hostname:my-port/my-db-name**

**DB2 magic in case of new UI service credentials.**

<img src ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/images/servicecredentials.png" width=600>  

*   Use the following format.

*   Add security=SSL at the end

**%sql ibm_db_sa://my-username:my-password\@my-hostname:my-port/my-db-name?security=SSL**

In [4]:
%sql mysql+mysqldb://root:bemb1983@localhost/SPACEX

In [5]:
DataBase = mysql.connector.connect(
  host ="localhost",
  user ="boly",
  passwd ="b0l1++",
  database = "SPACEX"
)
#df = pd.read_sql(""" SELECT * FROM SPACEX""",  conn = DataBase)


## Tasks

Now write and execute SQL queries to solve the assignment tasks.

### Task 1

##### Display the names of the unique launch sites  in the space mission

In [6]:
%sql SELECT DISTINCT(LaunchSite) FROM SX_data;

 * mysql+mysqldb://root:***@localhost/SPACEX
3 rows affected.

[('CCAFS SLC 40',), ('VAFB SLC 4E',), ('KSC LC 39A',)]

### Task 2

##### Display 5 records where launch sites begin with the string 'CCA'

In [7]:
%sql SELECT * FROM SX_data WHERE Launchsite LIKE "CCA%" LIMIT 5;

 * mysql+mysqldb://root:***@localhost/SPACEX
5 rows affected.

[(1, '2010-06-04', 'Falcon 9', '6104.959411764706', 'LEO', 'CCAFS SLC 40', 'None None', 1, 'False', 'False', 'False', '', Decimal('1.0'), 0, 'B0003', Decimal('-80.5773660'), Decimal('28.5618571'), 0),
 (2, '2012-05-22', 'Falcon 9', '525.0', 'LEO', 'CCAFS SLC 40', 'None None', 1, 'False', 'False', 'False', '', Decimal('1.0'), 0, 'B0005', Decimal('-80.5773660'), Decimal('28.5618571'), 0),
 (3, '2013-03-01', 'Falcon 9', '677.0', 'ISS', 'CCAFS SLC 40', 'None None', 1, 'False', 'False', 'False', '', Decimal('1.0'), 0, 'B0007', Decimal('-80.5773660'), Decimal('28.5618571'), 0),
 (5, '2013-12-03', 'Falcon 9', '3170.0', 'GTO', 'CCAFS SLC 40', 'None None', 1, 'False', 'False', 'False', '', Decimal('1.0'), 0, 'B1004', Decimal('-80.5773660'), Decimal('28.5618571'), 0),
 (6, '2014-01-06', 'Falcon 9', '3325.0', 'GTO', 'CCAFS SLC 40', 'None None', 1, 'False', 'False', 'False', '', Decimal('1.0'), 0, 'B1005', Decimal('-80.5773660'), Decimal('28.5618571'), 0)]

##### Successful rate outcome for each launch site

In [37]:
%sql SELECT COUNT(*)/(SELECT COUNT(*) FROM SX_data WHERE (Launchsite LIKE "CCA%")) FROM SX_data WHERE (Launchsite LIKE "CCA%" AND Outcome LIKE "True%");

 * mysql+mysqldb://root:***@localhost/SPACEX
1 rows affected.

[(Decimal('0.6000'),)]

In [36]:
%sql SELECT COUNT(*)/(SELECT COUNT(*) FROM SX_data WHERE (Launchsite LIKE "KSC%")) FROM SX_data WHERE (Launchsite LIKE "KSC%" AND Outcome LIKE "True%");

 * mysql+mysqldb://root:***@localhost/SPACEX
1 rows affected.

[(Decimal('0.7727'),)]

In [35]:
%sql SELECT COUNT(*)/(SELECT COUNT(*) FROM SX_data WHERE (Launchsite LIKE "VAFB%")) FROM SX_data WHERE (Launchsite LIKE "VAFB%" AND Outcome LIKE "True%");

 * mysql+mysqldb://root:***@localhost/SPACEX
1 rows affected.

[(Decimal('0.7692'),)]

### Task 3

##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [65]:
%sql SELECT ROUND(SUM(PayloadMass)) AS NASA_PAYLOAD FROM SX_data WHERE Orbit LIKE "%ISS%"

 * mysql+mysqldb://root:***@localhost/SPACEX
1 rows affected.

[(Decimal('68879'),)]

In [64]:
%sql SELECT ROUND(SUM(PayloadMass)) AS NASA_PAYLOAD FROM SX_data WHERE Orbit='ISS'

 * mysql+mysqldb://root:***@localhost/SPACEX
1 rows affected.

[(Decimal('68879'),)]

In [14]:
%sql SELECT ROUND(SUM(PayloadMass)) AS TOTAL_PAYLOAD FROM SX_data;

 * mysql+mysqldb://root:***@localhost/SPACEX
1 rows affected.

[(549446.0,)]

### Task 4

##### Display average payload mass carried by booster version F9 v1.1

In [ ]:
%sql SELECT AVG(PayloadMass)AS AVG_PAYLOAD_F9_V1_1 FROM SX_data WHERE Date >= '2013-09-29' AND Date <= '2016-01-17';

 * mysql+mysqldb://root:***@localhost/SPACEX
1 rows affected.

[(2428.0,)]

##### Successful outcome between 2 dates

In [25]:
%sql SELECT COUNT(*) FROM SX_data WHERE (Outcome LIKE "True%" AND Date >= '2013-09-29' AND Date <= '2012-01-17' )

 * mysql+mysqldb://root:***@localhost/SPACEX
1 rows affected.

[(0,)]

### Task 5

##### List the date when the first successful landing outcome in ground pad was acheived.

*Hint:Use min function*

In [30]:
%sql SELECT MIN(Date) AS 1st_Succ_Landing FROM SX_data WHERE Outcome='True RTLS';

 * mysql+mysqldb://root:***@localhost/SPACEX
1 rows affected.

[('2015-12-22',)]

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [55]:
%sql SELECT BoosterVersion, Serial, PayloadMass FROM SX_data WHERE Outcome='True ASDS' AND (PayloadMass> 4000 AND PayloadMass< 6000);

 * mysql+mysqldb://root:***@localhost/SPACEX
6 rows affected.

[('Falcon 9', 'B1022', Decimal('4696')),
 ('Falcon 9', 'B1026', Decimal('4600')),
 ('Falcon 9', 'B1021', Decimal('5300')),
 ('Falcon 9', 'B1031', Decimal('5200')),
 ('Falcon 9', 'B1046', Decimal('5800')),
 ('Falcon 9', 'B1059', Decimal('5000'))]

### Task 7

##### List the total number of successful and failure mission outcomes

In [57]:
%sql SELECT COUNT(*) FROM SX_data WHERE Outcome='False Ocean' OR Outcome='False ASDS' OR  Outcome='False RTLS' OR Outcome='None None';% sql SELECT Outco

 * mysql+mysqldb://root:***@localhost/SPACEX
1 rows affected.

[(28,)]

In [55]:
%sql SELECT COUNT(*) FROM SX_data WHERE Outcome='True Ocean' OR Outcome='True ASDS' OR  Outcome='True RTLS';

 * mysql+mysqldb://root:***@localhost/SPACEX
1 rows affected.

[(60,)]

In [58]:
%sql SELECT COUNT(*) FROM SX_data WHERE Outcome='None ASDS';

 * mysql+mysqldb://root:***@localhost/SPACEX
1 rows affected.

[(2,)]

### Task 8

##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [54]:
%sql SELECT BoosterVersion, Serial FROM SX_data WHERE PayloadMass=(SELECT MAX(PayloadMass) FROM SX_data)

 * mysql+mysqldb://root:***@localhost/SPACEX
3 rows affected.

[('Falcon 9', 'B1048'), ('Falcon 9', 'B1051'), ('Falcon 9', 'B1048')]

In [53]:
%sql SELECT MAX(PayloadMass) FROM SX_data;

 * mysql+mysqldb://root:***@localhost/SPACEX
1 rows affected.

[(Decimal('15600'),)]

### Task 9

##### List the failed landing_outcomes in drone ship, their booster versions, and launch site names for in year 2015

In [59]:
%sql SELECT BoosterVersion, Serial,LaunchSite, Date  FROM SX_data WHERE YEAR(Date)='2015' AND (Outcome='False ASDS' OR Outcome ='None ASDS');

 * mysql+mysqldb://root:***@localhost/SPACEX
3 rows affected.

[('Falcon 9', 'B1012', 'CCAFS SLC 40', '2015-01-10'),
 ('Falcon 9', 'B1015', 'CCAFS SLC 40', '2015-04-14'),
 ('Falcon 9', 'B1018', 'CCAFS SLC 40', '2015-06-28')]

 ### Task 10

##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order

In [61]:
%sql SELECT Outcome,COUNT(Outcome) FROM SX_data WHERE Outcome='False RTLS' OR Outcome='False ASDS'  GROUP BY Outcome ORDER BY COUNT(Outcome) ASC;

 * mysql+mysqldb://root:***@localhost/SPACEX
2 rows affected.

[('False RTLS', 1), ('False ASDS', 6)]

In [93]:
%sql SELECT min(PayloadMass) FROM SX_data;

 * mysql+mysqldb://root:***@localhost/SPACEX
1 rows affected.

[('12259.0',)]

In [43]:
%sql SELECT min(Date), max(Date) FROM SX_data;

 * mysql+mysqldb://root:***@localhost/SPACEX
1 rows affected.

[('2010-06-04', '2020-11-05')]

In [45]:
%sql SELECT DISTINCT(Outcome) FROM SX_data;

 * mysql+mysqldb://root:***@localhost/SPACEX
8 rows affected.

[('None None',),
 ('False Ocean',),
 ('True Ocean',),
 ('False ASDS',),
 ('None ASDS',),
 ('True RTLS',),
 ('True ASDS',),
 ('False RTLS',)]

In [42]:
%sql SELECT COUNT(*) AS TOTAL_FAILURE FROM SX_data WHERE Outcome='False RTLS' OR Outcome='False ASDS' OR Outcome='None None' OR Outcome='False Ocean' OR Outcome='None ASDS';

 * mysql+mysqldb://root:***@localhost/SPACEX
1 rows affected.

[(30,)]

In [44]:
%sql SELECT COUNT(*) AS TOTAL_SUCCESS FROM SX_data WHERE Outcome='True RTLS' OR Outcome='True ASDS' OR Outcome='True Ocean';

 * mysql+mysqldb://root:***@localhost/SPACEX
1 rows affected.

[(60,)]

  ### Reference Links

*   <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01&origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>

*   <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01&origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*   <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01&origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*   <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log

| Date       | Version | Changed by    | Change Description        |
| ---------- | ------- | ------------- | ------------------------- |
| 2021-10-12 | 0.4     | Lakshmi Holla | Changed markdown          |
| 2021-08-24 | 0.3     | Lakshmi Holla | Added library update      |
| 2021-07-09 | 0.2     | Lakshmi Holla | Changes made in magic sql |
| 2021-05-20 | 0.1     | Lakshmi Holla | Created Initial Version   |

## <h3 align="center"> © IBM Corporation 2021. All rights reserved. <h3/>